### Starter code for Project 4. 
#### Run these cells before starting the assignment.

#### 1. create BQ dataset:

In [1]:
%env dataset_id=school_enrollments

env: dataset_id=school_enrollments

In [2]:
!bq --location=US mk --dataset $dataset_id

BigQuery error in mk operation: Dataset 'mp-rh-cs327e:school_enrollments'
already exists.

#### 2. create and populate BQ tables:

In [3]:
import os

In [4]:
gsutil_cmd = "gsutil ls gs://cs327e-open-access/stanford-school-enrollment/*"
file_listings = os.popen(gsutil_cmd)
dataset="school_enrollments"

for file in file_listings:

    start_index = file.rindex("_") + 1
    end_index = file.rindex(".")
    table = file[start_index:end_index]
    
    if table in ("co", "district", "fl", "ga", "id", "ma", "mo", "ne", "ny", "or", "school", "sd", "wi"):
        print("skipping " + table)
        continue

    bq_cmd = "bq --location=US load --autodetect --skip_leading_rows=1 "\
             "--source_format=CSV " + dataset + "." + table + ' ' + file
    print(bq_cmd)
    
    os.system(bq_cmd)

bq --location=US load --autodetect --skip_leading_rows=1 --source_format=CSV school_enrollments.ak gs://cs327e-open-access/stanford-school-enrollment/zf406jp4427_ak.csv

Waiting on bqjob_r4c85d482a4d6c699_0000017f532be31b_1 ... (1s) Current status: DONE

bq --location=US load --autodetect --skip_leading_rows=1 --source_format=CSV school_enrollments.ar gs://cs327e-open-access/stanford-school-enrollment/zf406jp4427_ar.csv

Waiting on bqjob_r2528c2570dc90db3_0000017f532bf21f_1 ... (5s) Current status: DONE

bq --location=US load --autodetect --skip_leading_rows=1 --source_format=CSV school_enrollments.az gs://cs327e-open-access/stanford-school-enrollment/zf406jp4427_az.csv

Waiting on bqjob_r1015ddddbccb5899_0000017f532c10ff_1 ... (6s) Current status: DONE

bq --location=US load --autodetect --skip_leading_rows=1 --source_format=CSV school_enrollments.ca gs://cs327e-open-access/stanford-school-enrollment/zf406jp4427_ca.csv

Waiting on bqjob_r58b577877ba6ad25_0000017f532c33c0_1 ... (9s) Current status: DONE

skipping co
bq --location=US load --autodetect --skip_leading_rows=1 --source_format=CSV school_enrollments.ct gs://cs327e-open-access/stanford-school-enrollment/zf406jp4427_ct.csv

Waiting on bqjob_r4d8a57256a2e5224_0000017f532c62f0_1 ... (2s) Current status: DONE

skipping district
skipping fl
skipping ga
bq --location=US load --autodetect --skip_leading_rows=1 --source_format=CSV school_enrollments.hi gs://cs327e-open-access/stanford-school-enrollment/zf406jp4427_hi.csv

Waiting on bqjob_r64d38511bfcbe983_0000017f532c754e_1 ... (2s) Current status: DONE

skipping id
bq --location=US load --autodetect --skip_leading_rows=1 --source_format=CSV school_enrollments.in gs://cs327e-open-access/stanford-school-enrollment/zf406jp4427_in.csv

Waiting on bqjob_r716427d6cbf3741e_0000017f532c87a3_1 ... (3s) Current status: DONE

bq --location=US load --autodetect --skip_leading_rows=1 --source_format=CSV school_enrollments.la gs://cs327e-open-access/stanford-school-enrollment/zf406jp4427_la.csv

Waiting on bqjob_r75d2c24081627d01_0000017f532c9e61_1 ... (4s) Current status: DONE

skipping ma
bq --location=US load --autodetect --skip_leading_rows=1 --source_format=CSV school_enrollments.md gs://cs327e-open-access/stanford-school-enrollment/zf406jp4427_md.csv

Waiting on bqjob_r1748b140694102df_0000017f532cb8f8_1 ... (1s) Current status: DONE

bq --location=US load --autodetect --skip_leading_rows=1 --source_format=CSV school_enrollments.mn gs://cs327e-open-access/stanford-school-enrollment/zf406jp4427_mn.csv

Waiting on bqjob_r6a765cd6adbbe950_0000017f532cc762_1 ... (5s) Current status: DONE

skipping mo
bq --location=US load --autodetect --skip_leading_rows=1 --source_format=CSV school_enrollments.ms gs://cs327e-open-access/stanford-school-enrollment/zf406jp4427_ms.csv

Waiting on bqjob_r52238d89690699e7_0000017f532ce6e0_1 ... (2s) Current status: DONE

skipping ne
bq --location=US load --autodetect --skip_leading_rows=1 --source_format=CSV school_enrollments.nh gs://cs327e-open-access/stanford-school-enrollment/zf406jp4427_nh.csv

Waiting on bqjob_r9b573e427143022_0000017f532cf966_1 ... (2s) Current status: DONE

bq --location=US load --autodetect --skip_leading_rows=1 --source_format=CSV school_enrollments.nj gs://cs327e-open-access/stanford-school-enrollment/zf406jp4427_nj.csv

Waiting on bqjob_r606ab0e094f8b418_0000017f532d0be7_1 ... (1s) Current status: DONE

BigQuery error in load operation: Error processing job 'mp-rh-
cs327e:bqjob_r606ab0e094f8b418_0000017f532d0be7_1': Error while reading data,
error message: Could not parse 'N' as INT64 for field ccd_district_high_grade
(position 12) starting at location 2800632  with message 'Unable to parse'
Failure details:
- Error while reading data, error message: CSV processing encountered
too many errors, giving up. Rows: 12208; errors: 1; max bad: 0;
error percent: 0
- query: Could not parse 'N' as INT64 for field
ccd_district_high_grade (position 12) starting at location 2800632
with message 'Unable to parse'
bq --location=US load --autodetect --skip_leading_rows=1 --source_format=CSV school_enrollments.nm gs://cs327e-open-access/stanford-school-enrollment/zf406jp4427_nm.csv

Waiting on bqjob_r47d0e2d81a1da356_0000017f532d19c1_1 ... (2s) Current status: DONE

bq --location=US load --autodetect --skip_leading_rows=1 --source_format=CSV school_enrollments.nv gs://cs327e-open-access/stanford-school-enrollment/zf406jp4427_nv.csv

Waiting on bqjob_r3869ca0513b92924_0000017f532d2c54_1 ... (2s) Current status: DONE

skipping ny
bq --location=US load --autodetect --skip_leading_rows=1 --source_format=CSV school_enrollments.ok gs://cs327e-open-access/stanford-school-enrollment/zf406jp4427_ok.csv

Waiting on bqjob_r2ceea650c92f41ff_0000017f532d3ecc_1 ... (4s) Current status: DONE

skipping or
bq --location=US load --autodetect --skip_leading_rows=1 --source_format=CSV school_enrollments.pa gs://cs327e-open-access/stanford-school-enrollment/zf406jp4427_pa.csv

Waiting on bqjob_r5877f657f849b3c_0000017f532d58f0_1 ... (5s) Current status: DONE

bq --location=US load --autodetect --skip_leading_rows=1 --source_format=CSV school_enrollments.sc gs://cs327e-open-access/stanford-school-enrollment/zf406jp4427_sc.csv

Waiting on bqjob_r62255d090b1ed705_0000017f532d773d_1 ... (2s) Current status: DONE

skipping school
skipping sd
bq --location=US load --autodetect --skip_leading_rows=1 --source_format=CSV school_enrollments.tx gs://cs327e-open-access/stanford-school-enrollment/zf406jp4427_tx.csv

Waiting on bqjob_r43077efebe120b78_0000017f532d89af_1 ... (4s) Current status: DONE

bq --location=US load --autodetect --skip_leading_rows=1 --source_format=CSV school_enrollments.ut gs://cs327e-open-access/stanford-school-enrollment/zf406jp4427_ut.csv

Waiting on bqjob_r6ad2ecdb3175cbe8_0000017f532da4cf_1 ... (2s) Current status: DONE

bq --location=US load --autodetect --skip_leading_rows=1 --source_format=CSV school_enrollments.wa gs://cs327e-open-access/stanford-school-enrollment/zf406jp4427_wa.csv

Waiting on bqjob_r1b1ea388078954fa_0000017f532db78b_1 ... (4s) Current status: DONE

skipping wi
bq --location=US load --autodetect --skip_leading_rows=1 --source_format=CSV school_enrollments.wy gs://cs327e-open-access/stanford-school-enrollment/zf406jp4427_wy.csv

Waiting on bqjob_r2f8b12398e2b51b0_0000017f532dd1eb_1 ... (2s) Current status: DONE

#### 3. Find school enrollments by school name, grade level, and year for Texas

In [5]:
!bq show --schema=true $dataset_id.tx

[{"name":"state","type":"STRING","mode":"NULLABLE"},{"name":"county","type":"STRING","mode":"NULLABLE"},{"name":"county_state_id","type":"STRING","mode":"NULLABLE"},{"name":"admin_level","type":"STRING","mode":"NULLABLE"},{"name":"district_nces_id","type":"INTEGER","mode":"NULLABLE"},{"name":"district_state_id","type":"INTEGER","mode":"NULLABLE"},{"name":"district_state_type","type":"STRING","mode":"NULLABLE"},{"name":"district","type":"STRING","mode":"NULLABLE"},{"name":"ccd_district_type","type":"STRING","mode":"NULLABLE"},{"name":"ccd_charter","type":"STRING","mode":"NULLABLE"},{"name":"ccd_district_lvl","type":"STRING","mode":"NULLABLE"},{"name":"ccd_district_low_grade","type":"STRING","mode":"NULLABLE"},{"name":"ccd_district_high_grade","type":"STRING","mode":"NULLABLE"},{"name":"school_nces_id","type":"INTEGER","mode":"NULLABLE"},{"name":"school_state_id","type":"FLOAT","mode":"NULLABLE"},{"name":"school","type":"STRING","mode":"NULLABLE"},{"name":"school_state_type","type":"STRING","mode":"NULLABLE"},{"name":"ccd_school_type","type":"STRING","mode":"NULLABLE"},{"name":"ccd_charter_school","type":"BOOLEAN","mode":"NULLABLE"},{"name":"ccd_school_lvl","type":"STRING","mode":"NULLABLE"},{"name":"ccd_school_low_grade","type":"STRING","mode":"NULLABLE"},{"name":"ccd_school_high_grade","type":"STRING","mode":"NULLABLE"},{"name":"year","type":"INTEGER","mode":"NULLABLE"},{"name":"term","type":"STRING","mode":"NULLABLE"},{"name":"grade","type":"STRING","mode":"NULLABLE"},{"name":"white","type":"STRING","mode":"NULLABLE"},{"name":"black","type":"STRING","mode":"NULLABLE"},{"name":"hispanic","type":"STRING","mode":"NULLABLE"},{"name":"native_american","type":"STRING","mode":"NULLABLE"},{"name":"native_american_alaskan_native","type":"STRING","mode":"NULLABLE"},{"name":"asian","type":"STRING","mode":"NULLABLE"},{"name":"native_hawaiian","type":"STRING","mode":"NULLABLE"},{"name":"asian_pacific_islander","type":"STRING","mode":"NULLABLE"},{"name":"native_hawaiian_pacific_islander","type":"STRING","mode":"NULLABLE"},{"name":"pacific_islander","type":"STRING","mode":"NULLABLE"},{"name":"multiracial","type":"STRING","mode":"NULLABLE"},{"name":"unknown_race","type":"STRING","mode":"NULLABLE"},{"name":"male","type":"STRING","mode":"NULLABLE"},{"name":"female","type":"STRING","mode":"NULLABLE"},{"name":"non_binary","type":"STRING","mode":"NULLABLE"},{"name":"unknown_gender","type":"STRING","mode":"NULLABLE"},{"name":"ell","type":"STRING","mode":"NULLABLE"},{"name":"ell_percent","type":"STRING","mode":"NULLABLE"},{"name":"homeless","type":"STRING","mode":"NULLABLE"},{"name":"homeless_percent","type":"STRING","mode":"NULLABLE"},{"name":"low_income","type":"STRING","mode":"NULLABLE"},{"name":"free_and_reduced","type":"STRING","mode":"NULLABLE"},{"name":"free_and_reduced_percent","type":"STRING","mode":"NULLABLE"},{"name":"disability","type":"STRING","mode":"NULLABLE"},{"name":"section_504","type":"STRING","mode":"NULLABLE"},{"name":"total","type":"STRING","mode":"NULLABLE"}]

#### Note: STRING type for "total" column

In [6]:
%%bigquery
select school, grade, year, sum(cast(replace(replace(total, ",", ""), "<", "") as int64)) as total
from school_enrollments.tx
where total != "" and school != "" and district like '%AUSTIN%'
group by school, grade, year
order by school, grade, year

Query complete after 0.01s: 100%|██████████| 3/3 [00:00<00:00, 1441.67query/s]
Downloading: 100%|██████████| 1739/1739 [00:01<00:00, 1738.27rows/s]

         school             grade  year  total
0     AKINS H S          grade_10  2020   1440
1     AKINS H S          grade_10  2021   1494
2     AKINS H S          grade_11  2020   1328
3     AKINS H S          grade_11  2021   1326
4     AKINS H S          grade_12  2020   1218
...         ...               ...   ...    ...
1734  ZILKER EL           grade_5  2021    138
1735  ZILKER EL      kindergarten  2020    154
1736  ZILKER EL      kindergarten  2021    126
1737  ZILKER EL  pre_kindergarten  2020     60
1738  ZILKER EL  pre_kindergarten  2021     26

[1739 rows x 4 columns]

##### Documentation on BQ's string functions: https://cloud.google.com/bigquery/docs/reference/standard-sql/string_functions

In [17]:
!bq --location=US mk --dataset "views"

BigQuery error in mk operation: Dataset 'mp-rh-cs327e:views' already exists.

In [18]:
%%bigquery
create view views.austin_enrollments_by_school_grade_year as
select school, grade, year, sum(cast(replace(replace(total, ",", ""), "<", "") as int64)) as total
from school_enrollments.tx
where total != "" and school != "" and district like '%AUSTIN%'
group by school, grade, year
order by school, grade, year

Executing query with job ID: 8e6f696a-cfd8-4ef8-a506-953773a86f90
Query executing: 0.26s

ERROR:
 409 Already Exists: Table mp-rh-cs327e:views.austin_enrollments_by_school_grade_year

Location: US
Job ID: 8e6f696a-cfd8-4ef8-a506-953773a86f90

In [20]:
%%bigquery
select * from views.austin_enrollments_by_school_grade_year

Query complete after 0.00s: 100%|██████████| 1/1 [00:00<00:00, 613.02query/s]
Downloading: 100%|██████████| 1739/1739 [00:01<00:00, 1421.89rows/s]

         school             grade  year  total
0     AKINS H S          grade_10  2020   1440
1     AKINS H S          grade_10  2021   1494
2     AKINS H S          grade_11  2020   1328
3     AKINS H S          grade_11  2021   1326
4     AKINS H S          grade_12  2020   1218
...         ...               ...   ...    ...
1734  ZILKER EL           grade_5  2021    138
1735  ZILKER EL      kindergarten  2020    154
1736  ZILKER EL      kindergarten  2021    126
1737  ZILKER EL  pre_kindergarten  2020     60
1738  ZILKER EL  pre_kindergarten  2021     26

[1739 rows x 4 columns]

#### 4. Open Data Studio and create a chart from this view:
##### https://datastudio.google.com/

#### Project 4 homework marker. Start homework from here.

##### Write 8 aggregate queries over the school enrollment tables:

###### All queries should use a GROUP BY clause, one or more aggregate functions, and an ORDER BY clause
###### At least 4 queries should use a HAVING clause
###### At least 4 queries should use a WHERE clause
###### At least 2 queries should use a UNION ALL or UNION DISTINCT.
###### Precede each query with a Markdown comment that describes its function

#### Query 1
##### Make query of schools from Rose's hometown school district: Conroe ISD

In [44]:
%%bigquery
select school, district, grade, sum(cast(replace(replace(total, ",", ""), "<", "") as int64)) as total
from school_enrollments.tx
where total != "" and school != "" and district like '%CONROE%'
group by district, school, grade, year
order by school, grade, year

Query complete after 0.00s: 100%|██████████| 1/1 [00:00<00:00, 1038.71query/s]
Downloading: 100%|██████████| 615/615 [00:01<00:00, 547.74rows/s]

           school    district             grade  total
0     ANDERSON EL  CONROE ISD   early_education     36
1     ANDERSON EL  CONROE ISD   early_education     42
2     ANDERSON EL  CONROE ISD           grade_1    244
3     ANDERSON EL  CONROE ISD           grade_1    188
4     ANDERSON EL  CONROE ISD           grade_2    216
..            ...         ...               ...    ...
610  WILKINSON EL  CONROE ISD  pre_kindergarten     70
611      YORK J H  CONROE ISD           grade_7   1760
612      YORK J H  CONROE ISD           grade_7   1902
613      YORK J H  CONROE ISD           grade_8   1580
614      YORK J H  CONROE ISD           grade_8   1850

[615 rows x 4 columns]

#### Query 2
##### Made query of Rose's hometown school district on the basis that the database has information for more than one year ordered by grade, school, and year descending

In [45]:
%%bigquery
select school, district, grade, sum(cast(replace(replace(total, ",", ""), "<", "") as int64)) as total, year, count(year) as num_year
from school_enrollments.tx
where total != "" and school != "" and district like '%CONROE%'
group by district, school, year, grade
having num_year > 1
order by grade, school, year desc

Query complete after 0.00s: 100%|██████████| 1/1 [00:00<00:00, 1198.72query/s]
Downloading: 100%|██████████| 615/615 [00:01<00:00, 570.02rows/s]

           school    district             grade  total  year  num_year
0     ANDERSON EL  CONROE ISD   early_education     42  2021         2
1     ANDERSON EL  CONROE ISD   early_education     36  2020         2
2    ARMSTRONG EL  CONROE ISD   early_education     20  2021         2
3    ARMSTRONG EL  CONROE ISD   early_education     20  2020         2
4       AUSTIN EL  CONROE ISD   early_education     20  2021         2
..            ...         ...               ...    ...   ...       ...
610    STEWART EL  CONROE ISD  pre_kindergarten     60  2021         2
611    STEWART EL  CONROE ISD  pre_kindergarten     60  2020         2
612     SUCHMA EL  CONROE ISD  pre_kindergarten     80  2020         2
613  WILKINSON EL  CONROE ISD  pre_kindergarten     70  2021         2
614  WILKINSON EL  CONROE ISD  pre_kindergarten    100  2020         2

[615 rows x 6 columns]

#### Query 3
##### Made query of Rose's high school grade levels having more than 1550 students enrolled based on total enrollments by grade by year
###### Note: grade_9 comes first becuase the first digit is "9" and not "09"

In [46]:
%%bigquery
select school, district, grade, sum(cast(replace(replace(total, ",", ""), "<", "") as int64)) as total, year
from school_enrollments.tx
where total != "" and school like '%COLLEGE PARK%' and district like '%CONROE%'
group by district, school, year, grade
having total > 1550
order by school, year desc, grade desc

Query complete after 0.00s: 100%|██████████| 1/1 [00:00<00:00, 1286.99query/s]
Downloading: 100%|██████████| 4/4 [00:01<00:00,  3.70rows/s]

             school    district     grade  total  year
0  COLLEGE PARK H S  CONROE ISD  grade_11   1654  2021
1  COLLEGE PARK H S  CONROE ISD  grade_10   1582  2021
2  COLLEGE PARK H S  CONROE ISD  grade_11   1564  2020
3  COLLEGE PARK H S  CONROE ISD  grade_10   1720  2020

#### Query 4
##### Query of the Texas schools that are considered high schools but the lowest grade they offer is less than 9th and that have less than 100 students

In [47]:
%%bigquery
select school, grade, ccd_school_low_grade, ccd_school_lvl, sum(cast(replace(replace(total, ",", ""), "<", "") as int64)) as total
from school_enrollments.tx
where total != "" and school != "" and ccd_school_low_grade != "09" and ccd_school_low_grade not like '1%' and ccd_school_lvl like "%High%"
group by school, ccd_school_low_grade, grade, ccd_school_lvl
having total < 100
order by ccd_school_low_grade desc, total desc, school, grade

Query complete after 0.00s: 100%|██████████| 3/3 [00:00<00:00, 2209.47query/s]
Downloading: 100%|██████████| 1785/1785 [00:01<00:00, 1744.36rows/s]

,school,grade,ccd_school_low_grade,ccd_school_lvl,total
0,SOMERVILLE H S,grade_12,08,High,92
1,TEXAS EARLY COLLEGE H S,grade_12,08,High,92
2,TEXAS EARLY COLLEGE H S,grade_10,08,High,88
3,WOODSON CENTER FOR EXCELLENCE,grade_11,08,High,88
4,CAMERON CO J J A E P,grade_9,08,High,86
...,...,...,...,...,...
1780,WICHITA COUNTY JUVENILE JUSTICE AE,grade_9,05,High,20
1781,WOODROW WILSON DAEP,grade_12,05,High,20
1782,WOODROW WILSON DAEP,grade_5,05,High,20
1783,WOODROW WILSON DAEP,grade_6,05,High,20
1784,WOODROW WILSON DAEP,grade_7,05,High,20

#### Query 5
##### This is a selection query that returns the number of students by grade classes in schools if there are more than 10 students in them throughout Texas.

In [48]:
%%bigquery
select school, grade, ccd_school_type, count(ccd_school_type) as no_students
from school_enrollments.tx
where ccd_school_type != "" and school != "" and grade != ""
group by school, ccd_school_type, grade
having no_students > 5
order by school, grade, no_students desc

Query complete after 0.00s: 100%|██████████| 1/1 [00:00<00:00, 1125.69query/s]
Downloading: 100%|██████████| 3298/3298 [00:01<00:00, 2831.66rows/s]

         school             grade ccd_school_type  no_students
0      ADAMS EL   early_education  Regular School            6
1      ADAMS EL           grade_1  Regular School            8
2      ADAMS EL           grade_2  Regular School            8
3      ADAMS EL           grade_3  Regular School            8
4      ADAMS EL           grade_4  Regular School            8
...         ...               ...             ...          ...
3293  ZAVALA EL           grade_4  Regular School           24
3294  ZAVALA EL           grade_5  Regular School           20
3295  ZAVALA EL      kindergarten  Regular School           20
3296  ZAVALA EL       pk_12_total  Regular School           24
3297  ZAVALA EL  pre_kindergarten  Regular School           20

[3298 rows x 4 columns]

#### Query 6
##### This selection query returns the total number of students in each school district throughout the state of Texas.

In [49]:
%%bigquery
select district, district_state_id, sum(cast(replace(replace(total, ",", ""), "<", "") as int64)) as total
from school_enrollments.tx
where ccd_charter_school is False and total != ""
group by district, district_state_id
order by total desc

Query complete after 0.00s: 100%|██████████| 1/1 [00:00<00:00, 1231.45query/s]
Downloading: 100%|██████████| 1019/1019 [00:01<00:00, 942.16rows/s]

                   district  district_state_id   total
0               HOUSTON ISD             101912  771340
1                DALLAS ISD              57905  599720
2     CYPRESS-FAIRBANKS ISD             101907  465760
3             NORTHSIDE ISD              15915  423822
4                  KATY ISD             101914  335850
...                     ...                ...     ...
1014  DOSS CONSOLIDATED CSD              86024     300
1015  GRANDVIEW-HOPKINS ISD              90905     280
1016        SAN VICENTE ISD              22903     280
1017            HIGGINS ISD             148903     260
1018             DIVIDE ISD             133905     260

[1019 rows x 3 columns]

#### Query 7
##### This selection query returns the number of students for both genders recorded for schools that are in Dallas, Austin, and Houston school districts.

In [50]:
%%bigquery
select school, district, male, female
from school_enrollments.tx
where district like '%AUSTIN%' and male != "" and female != "" and school != ""
union distinct
select school, district, male, female
from school_enrollments.tx
where district like '%DALLAS%' and male != "" and female != "" and school != ""
union distinct
select school, district, male, female
from school_enrollments.tx
where district like '%HOUSTON%' and male != "" and female != "" and school != ""
group by district, school, male, female
order by school, district

Query complete after 0.00s: 100%|██████████| 1/1 [00:00<00:00, 1227.84query/s]
Downloading: 100%|██████████| 1307/1307 [00:01<00:00, 1220.28rows/s]

                           school           district male female
0               ACADEMY OF DALLAS  ACADEMY OF DALLAS  157    184
1               ACADEMY OF DALLAS  ACADEMY OF DALLAS  238    242
2       ADELFA BOTELLO CALLEJO EL         DALLAS ISD  278    243
3       ADELFA BOTELLO CALLEJO EL         DALLAS ISD  326    270
4                ADELLE TURNER EL         DALLAS ISD  163    126
...                           ...                ...  ...    ...
1302  ZAN WESLEY HOLMES JR MIDDLE         DALLAS ISD  393    364
1303                    ZAVALA EL         AUSTIN ISD  109    121
1304                    ZAVALA EL         AUSTIN ISD  126    122
1305                    ZILKER EL         AUSTIN ISD  238    205
1306                    ZILKER EL         AUSTIN ISD  283    214

[1307 rows x 4 columns]

#### Query 8
##### This selection shows the schools in Austin and Dallas isd and their total school population in order from greatest to least.

In [51]:
%%bigquery
select district, school, sum(cast(replace(replace(total, ",", ""), "<", "") as int64)) as total
from school_enrollments.tx
where district like '%AUSTIN%' and school != "" and total != ""
group by district, school
having total >1000
union all
select district, school, sum(cast(replace(replace(total, ",", ""), "<", "") as int64)) as total
from school_enrollments.tx
where district like '%DALLAS%' and school != "" and total != ""
group by district, school
having total >1000
order by total desc

Query complete after 0.00s: 100%|██████████| 1/1 [00:00<00:00, 1255.78query/s]
Downloading: 100%|██████████| 341/341 [00:01<00:00, 309.57rows/s]

,district,school,total
0,DALLAS ISD,SKYLINE H S,16586
1,AUSTIN ISD,BOWIE H S,11464
2,AUSTIN ISD,AKINS H S,11124
3,AUSTIN ISD,AUSTIN H S,9418
4,AUSTIN ISD,ANDERSON H S,8914
...,...,...,...
336,AUSTIN ISD,ROSEDALE,1018
337,STEPHEN F AUSTIN STATE UNIVERSITY,STEPHEN F AUSTIN STATE UNIVERSITY,1018
338,AUSTIN ISD,BEAR CREEK EL,1014
339,DALLAS ISD,ROSIE SORRELLS EDUCATION AND SOCIA,1010
340,AUSTIN ISD,ZAVALA EL,1008

##### New BQ dataset to store database *views*

In [15]:
# views already exists because it was made earlier in this file
!bq --location=US mk --dataset "views"

BigQuery error in mk operation: Dataset 'mp-rh-cs327e:views' already exists.

##### First view:
###### students_in_each_district_in_Texas
###### This selection query returns the total number of students in each school district throughout the state of Texas.

In [53]:
%%bigquery
create view views.students_in_each_district_in_Texas as
select district, district_state_id, sum(cast(replace(replace(total, ",", ""), "<", "") as int64)) as total
from school_enrollments.tx
where ccd_charter_school is False and total != ""
group by district, district_state_id
order by total desc

Executing query with job ID: 2f84bfb3-1f76-4959-a3c8-d0df511dd45c
Query executing: 0.27s

ERROR:
 409 Already Exists: Table mp-rh-cs327e:views.students_in_each_district_in_Texas

Location: US
Job ID: 2f84bfb3-1f76-4959-a3c8-d0df511dd45c

##### Second view:
###### student_population_of_Dallas_and_Austin_districts_by_school
###### This selection shows the schools in Austin and Dallas isd and their total school population in order from greatest to least.

In [19]:
%%bigquery
create view views.student_population_of_Dallas_and_Austin_districts_by_school as
select district, school, sum(cast(replace(replace(total, ",", ""), "<", "") as int64)) as total
from school_enrollments.tx
where district like '%AUSTIN%' and school != "" and total != ""
group by district, school
having total >1000
union all
select district, school, sum(cast(replace(replace(total, ",", ""), "<", "") as int64)) as total
from school_enrollments.tx
where district like '%DALLAS%' and school != "" and total != ""
group by district, school
having total >1000
order by total desc

Query complete after 0.00s: 100%|██████████| 1/1 [00:00<00:00, 1034.61query/s]

Empty DataFrame
Columns: []
Index: []

In [52]:
# original cell where students_in_each_district_in_Texas was made

Query complete after 0.00s: 100%|██████████| 1/1 [00:00<00:00, 1409.85query/s]

Empty DataFrame
Columns: []
Index: []